; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	instrument6 - instrument
	thermograph0 - mode
	image1 - mode
	image2 - mode
	Star0 - direction
	Star4 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument1 image1)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 image1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
	(supports instrument3 image1)
	(supports instrument3 image2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
	(supports instrument5 image2)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument5 satellite4)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon6)
)
(:goal (and
	(pointing satellite2 Phenomenon8)
	(have_image Star5 thermograph0)
	(have_image Phenomenon6 image1)
	(have_image Phenomenon7 image1)
	(have_image Phenomenon8 thermograph0)
	(have_image Planet9 thermograph0)
	(have_image Star10 image1)
	(have_image Planet11 thermograph0)
))

)

; plan
1. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 8
2. (calibrate satellite2 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 0 of 8
3. (turn_to satellite2 planet9 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 planet9)
   goals met: 0 of 8
4. (take_image satellite2 planet9 instrument3 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 1 of 8
5. (turn_to satellite2 planet11 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 planet11)
   goals met: 1 of 8
6. (take_image satellite2 planet11 instrument3 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 2 of 8
7. (turn_to satellite2 phenomenon7 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon7)
   goals met: 2 of 8
8. (take_image satellite2 phenomenon7 instrument3 image1)
   added: (have_image phenomenon7 image1)
   goals met: 3 of 8
9. (turn_to satellite2 phenomenon6 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 phenomenon6)
   goals met: 3 of 8
10. (take_image satellite2 phenomenon6 instrument3 image1)
   added: (have_image phenomenon6 image1)
   goals met: 4 of 8
11. (turn_to satellite2 star10 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 star10)
   goals met: 4 of 8
12. (take_image satellite2 star10 instrument3 image1)
   added: (have_image star10 image1)
   goals met: 5 of 8
13. (turn_to satellite2 star5 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star5)
   goals met: 5 of 8
14. (take_image satellite2 star5 instrument3 thermograph0)
   added: (have_image star5 thermograph0)
   goals met: 6 of 8
15. (turn_to satellite2 phenomenon8 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 phenomenon8)
   goals met: 7 of 8
16. (take_image satellite2 phenomenon8 instrument3 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 8 of 8
